src/AccumulationRegisters/OrdersDispatched.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>OrdersDispatched</Name>
			<Comment>Requested items according to purchase and internal orders</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Received</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceivedIR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Invoiced</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ItemReceipt</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ItemReceipt</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DeliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Classes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/OrdersRegistered.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>OrdersRegistered</Name>
			<Comment>Demanded items according to sales and internal orders</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Shipped</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ShippedShipment</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Invoiced</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Shipment</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Shipment</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DeliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Classes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/InventoryJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>InventoryJournal</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Layer</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.ItemReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ItemAdjustment</v8:Type>
						<v8:Type>cfg:DocumentRef.Assembly</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/Notifications.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>Notifications</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/DocumentJournalOfCompanies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>DocumentJournalOfCompanies</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DocumentStatus</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Shipment</v8:Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
						<v8:Type>cfg:DocumentRef.TimeTrack</v8:Type>
						<v8:Type>cfg:DocumentRef.Statement</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ItemReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseReturn</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Line</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/InventoryTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>InventoryTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NonInventory</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/NotificationsServerFullRights/Ext/Module.bsl
Procedure CheckReorderQty() Export
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	OrdersDispatchedBalance.Product AS Product,
	|	CASE
	|		WHEN OrdersDispatchedBalance.QuantityBalance - OrdersDispatchedBalance.ReceivedBalance > 0
	|			THEN (OrdersDispatchedBalance.QuantityBalance - OrdersDispatchedBalance.ReceivedBalance) * OrdersDispatchedBalance.Unit.Factor
	|		ELSE 0
	|	END AS QtyOnPO,
	|	0 AS QtyOnSO,
	|	0 AS QtyOnHand
	|INTO Table_OrdersDispatched_OrdersRegistered_InventoryJournal
	|FROM
	|	AccumulationRegister.OrdersDispatched.Balance(, Product.Type = VALUE(Enum.InventoryTypes.Inventory)) AS OrdersDispatchedBalance
	|
	|UNION ALL
	|
	|SELECT
	|	OrdersRegisteredBalance.Product,
	|	0,
	|	CASE
	|		WHEN OrdersRegisteredBalance.QuantityBalance - OrdersRegisteredBalance.ShippedBalance > 0
	|			THEN (OrdersRegisteredBalance.QuantityBalance - OrdersRegisteredBalance.ShippedBalance) * OrdersRegisteredBalance.Unit.Factor
	|		ELSE 0
	|	END,
	|	0
	|FROM
	|	AccumulationRegister.OrdersRegistered.Balance(, Product.Type = VALUE(Enum.InventoryTypes.Inventory)) AS OrdersRegisteredBalance
	|
	|UNION ALL
	|
	|SELECT
	|	InventoryJournalBalance.Product,
	|	0,
	|	0,
	|	InventoryJournalBalance.QuantityBalance
	|FROM
	|	AccumulationRegister.InventoryJournal.Balance(, Product.Type = VALUE(Enum.InventoryTypes.Inventory)) AS InventoryJournalBalance
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Products.Ref AS Product,
	|	SUM(ISNULL(TableBalances.QtyOnPO, 0)) AS QtyOnPO,
	|	SUM(ISNULL(TableBalances.QtyOnSO, 0)) AS QtyOnSO,
	|	SUM(ISNULL(TableBalances.QtyOnHand, 0)) AS QtyOnHand,
	|	SUM(ISNULL(TableBalances.QtyOnHand, 0)) + SUM(ISNULL(TableBalances.QtyOnPO, 0)) - SUM(ISNULL(TableBalances.QtyOnSO, 0)) AS QtyAvailableToPromise
	|INTO Table_ATP
	|FROM
	|	Catalog.Products AS Products
	|		LEFT JOIN Table_OrdersDispatched_OrdersRegistered_InventoryJournal AS TableBalances
	|		ON Products.Ref = TableBalances.Product
	|WHERE
	|	Products.DeletionMark = FALSE
	|	AND Products.Type = VALUE(Enum.InventoryTypes.Inventory)
	|	AND Products.ReorderQty <> 0
	|
	|GROUP BY
	|	Products.Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table_ATP.Product AS Product,
	|	Table_ATP.Product.ReorderQty AS ReorderQty,
	|	Table_ATP.QtyAvailableToPromise AS QtyAvailableToPromise 
	|FROM
	|	Table_ATP AS Table_ATP
	|WHERE
	|	Table_ATP.Product.ReorderQty >= Table_ATP.QtyAvailableToPromise";
	
	QueryResult = Query.Execute();
	
	SDR = QueryResult.Select();
	
	While SDR.Next() Do
		
		CurrentDate = BegOfDay(CurrentSessionDate());
		Text = "" + SDR.Product + " - Available to promise: " + SDR.QtyAvailableToPromise + ", Reorder Qty: " + SDR.ReorderQty + "!";
		
		RecordSet = InformationRegisters.Notifications.CreateRecordSet();	
		RecordSet.Filter.Period.Set(CurrentDate);
		RecordSet.Filter.Subject.Set(Text);
		
		NewRecord = RecordSet.Add();
		NewRecord.Period      = CurrentDate;
		NewRecord.Subject     = Text;
		NewRecord.Description = Text;
		NewRecord.Object      = SDR.Product;
		
		RecordSet.Write();
		
	EndDo;
	
EndProcedure

#Region Updating_InformationRegister_DocumentJournalOfCompanies

Procedure DocumentJournalOfCompaniesOnWrite(Source, Cancel) Export
	
	If Cancel Then Return; EndIf;
	
	SourceType = TypeOf(Source.Ref);
	
	RecordSet = InformationRegisters.DocumentJournalOfCompanies.CreateRecordSet();	
	RecordSet.Filter.Document.Set(Source.Ref);
	
	VT = RecordSet.Unload();
	VT.Clear();
	
	//1.
	If SourceType = Type("DocumentRef.SalesInvoice") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//2.	
	ElsIf SourceType = Type("DocumentRef.SalesOrder") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DeliveryDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//3.	
	ElsIf SourceType = Type("DocumentRef.SalesReturn") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//4.	
	ElsIf SourceType = Type("DocumentRef.PurchaseReturn") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//5.	
	ElsIf SourceType = Type("DocumentRef.PurchaseOrder") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DeliveryDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//6.	
	ElsIf SourceType = Type("DocumentRef.PurchaseInvoice") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//7.	
	ElsIf SourceType = Type("DocumentRef.InvoicePayment") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//8.	
	ElsIf SourceType = Type("DocumentRef.Check") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//9.	
	ElsIf SourceType = Type("DocumentRef.CashSale") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//10.	
	ElsIf SourceType = Type("DocumentRef.CashReceipt") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.CashPayment;
		LineVT.Memo           = Source.Memo;
		
		//11.	
	ElsIf SourceType = Type("DocumentRef.Deposit") Then
		
		LineNumber = 0;
		
		For Each SourceLine In Source.Accounts Do
			
			LineNumber = LineNumber + 1;
			
			LineVT = VT.Add();
			LineVT.Company        = SourceLine.Company; 
			LineVT.Document       = Source.Ref; 
			LineVT.Line           = LineNumber;
			LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
			LineVT.Date           = Source.Date;
			//LineVT.DueDate        = SourceLine.DueDate;
			LineVT.Total          = SourceLine.Amount;
			LineVT.Memo           = SourceLine.Memo;
			
		EndDo;
		
		//12.	
	ElsIf SourceType = Type("DocumentRef.GeneralJournalEntry") Then
		
		LineNumber = 0;
		
		For Each SourceLine In Source.LineItems Do
			
			LineNumber = LineNumber + 1;
			
			LineVT = VT.Add();
			LineVT.Company        = SourceLine.Company; 
			LineVT.Document       = Source.Ref; 
			LineVT.Line           = LineNumber;
			LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
			LineVT.Date           = Source.Date;
			LineVT.DueDate        = Source.DueDate;
			LineVT.Total          = ?(SourceLine.AmountDr = 0, SourceLine.AmountCr, SourceLine.AmountDr);
			LineVT.Memo           = SourceLine.Memo;
			
		EndDo;
		
		//13.	
	ElsIf SourceType = Type("DocumentRef.TimeTrack") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.Price * Source.TimeComplete;
		LineVT.Memo           = Source.Memo;
		
		//14.	
	ElsIf SourceType = Type("DocumentRef.Statement") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		//LineVT.Total          = Source.Price * Source.TimeComplete;
		//LineVT.Memo           = Source.Memo;
		
		//15.	
	ElsIf SourceType = Type("DocumentRef.Quote") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		//LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//16.	
	ElsIf SourceType = Type("DocumentRef.ItemReceipt") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.DueDate        = Source.DueDate;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
		//17.	
	ElsIf SourceType = Type("DocumentRef.Shipment") Then
		
		LineVT = VT.Add();
		LineVT.Company        = Source.Company; 
		LineVT.Document       = Source.Ref; 
		LineVT.Line           = 1;
		LineVT.DocumentStatus = GetDocumentStatus(Source.Ref);
		LineVT.Date           = Source.Date;
		LineVT.Total          = Source.DocumentTotalRC;
		LineVT.Memo           = Source.Memo;
		
	EndIf;
	
	If Not Cancel Then
		
		RecordSet.Load(VT);
		RecordSet.Write();
		
	EndIf;
	
EndProcedure

Function GetDocumentStatus(DocumentRef)
	
	DocumentStatus = 0;	
	
	If Not DocumentRef.Posted And Not DocumentRef.DeletionMark Then
		DocumentStatus = 0;
	ElsIf DocumentRef.Posted And Not DocumentRef.DeletionMark Then
		DocumentStatus = 1;
	ElsIf Not DocumentRef.Posted And DocumentRef.DeletionMark Then
		DocumentStatus = 2;
	ElsIf DocumentRef.Posted AND DocumentRef.DeletionMark Then
		DocumentStatus = 4;
	EndIf;
		
	Return DocumentStatus;
	
EndFunction

#EndRegion
